{
  "basics": {
    "name": "Wisam Al Abed",
    "label": "I’m a full stack software engineer who can build apps from the ground up.",
    "image": "https://avatars.githubusercontent.com/u/4520207?s=400&u=f613d22d9121030d44a9a53af8c88c7df401580f&v=4",
    "email": "wisam.alabed@hey.com",
    "phone": "(416) 276-4074",
    "summary": "Wisam has over 10 years of experience of building software utilizing an array of programming languages, technologies and software frameworks. Subject matter expert in Web development, and Model Driven Engineering. Focused on software usability, re-usability, scalability and working in an agile manner. Experienced in developing user-centric solutions that deliver maximum value. Adept at leading teams in achieving excellence in client satisfaction, productivity, and profitability.",
    "location": {
      "city": "Toronto",
      "countryCode": "CA"
    }
  },
  "education": [
    {
      "endDate": "2007-06-01",
      "startDate": "2003-09-01",
      "area": "Software Engineering",
      "studyType": "Bachelors",
      "institution": "McGill University"
    }
  ],
  "skills": [
    {
      "keywords": [
        "HTML/CSS",
        "Typescript/Javascript",
        "SQL/NoSQL",
        "GraphQL"
      ],
      "level": "Senior",
      "name": "Programming Languages"
    },
    {
      "keywords": [
        "Node.js/Express",
        "React.js",
        "Redis",
        "Next.js",
        "Sanity.io",
        "Shopify"
      ],
      "level": "Senior",
      "name": "Frameworks"
    },
    {
      "keywords": [
        "Vercel",
        "G Cloud",
        "Kubernetes",
        "Docker",
        "Git"
      ],
      "level": "Beginner",
      "name": "Devops"
    }
  ],
  "work": [
    {
      "summary": "Joined The DSI as part of the initiative to collaborate with researchers to transform ideas into real world solutions.",
      "website": "https://datasciences.utoronto.ca",
      "name": "University of Toronto",
      "pinned": true,
      "location": "Toronto",
      "position": "Senior Software Engineer",
      "startDate": "2022-10-03",
      "endDate": "current",
      "highlights": []
    },
    {
      "summary": "Joined Kotn as part of the digital team to transform and scale their e-commerce experience.",
      "website": "https://kotn.com",
      "name": "Kotn",
      "location": "Toronto",
      "position": "Intermediate Software Developer",
      "startDate": "2020-03-30",
      "endDate": "2022-06-22",
      "highlights": [
        "Migrated the e-commerce site to a headless site built using NextJS that connects to the shopify backend",
        "Set up sanity.io as the CMS for managing content on the site",
        "Built a redis cache layer as a microservice for fetching product data for the site",
        "Implemented complex features such as bundle product pages, product reviews, size guides"
      ]
    },
    {
      "summary": "Joined IBM Dubai as part of Global Business Services for delivering consulting engagements.",
      "website": "https://www.ibm.com/ae-en",
      "name": "IBM MEA",
      "location": "Dubai",
      "position": "Business/Technical Analyst",
      "startDate": "2016-09",
      "endDate": "2018-09",
      "highlights": [
        "SMART Mufti chatbot: Built and designed a chatbot that will be able to answer questions about islamic legal rulings . Analyzed and categorized user submitted legal questions. Created entities and intents for each question based on the categorization (Watson Assistant). Ran K-Fold to analyze the accuracy and precision of the categorization",
        "RTA Chatbot: Built and developed the responsive web front end for the enterprise chat bot application. I took the design provided by the client and built the web front end for the chat bot application. Frontend built using HTML / CSS and javascript that connects to a node JS backend API",
        "VAT: Business and System Analyst to assess the VAT impact and changes needed on the systems used by the various business entities in order to be compliant with the new Government VAT requirements in Jan 2018. Conducted workshops with each business entity to gather the requirements and identify the impact on the business processes and financial systems used. Analyzed and Assessed the requirements producing a business requirements document. This document was used by the respective business entities to modify and change their systems accordingly",
        "Developed and built a demo that runs on Blockchain Hyperledger fabric v0.6 for capturing the life cycle of a vehicle from manufacturing to scrap"
      ]
    },
    {
      "summary": "Developed a website for connecting shippers to truckers to make transportation of goods more efficient and profitable.",
      "website": "https://www.xypper.com",
      "name": "XYpper Technologies",
      "location": "Canada",
      "position": "Full Stack Developer",
      "startDate": "2015-09",
      "endDate": "2016-09",
      "highlights": [
        "Designed a sophisticated search algorithm to allow shippers to find prospective truckers",
        "Automated the ordering, billing, and invoicing between shippers and truckers",
        "Redesigned the front end to use bootstrap and improved the UI/UX to make it more usable and functional and responsive.",
        "Redesigned the backend to be more lean and robust. Improved performance of the shipper search page. Improved search from taking a minute to taking 5s.",
        "Built the website notification system (full stack) for users receiving messages and order information in real time",
        "Designed and contributed to the invoicing management system to facilitate the invoicing between the shipper and trucker."
      ]
    },
    {
      "summary": "Joined the software engineering lab",
      "website": "https://www.cs.mcgill.ca/~joerg/SEL/SEL_Home.html",
      "name": "McGill University",
      "location": "Canada",
      "position": "Software Researcher",
      "startDate": "2008-09",
      "endDate": "2014-12",
      "highlights": [
        "Focused on software reusability, modularity and model driven engineering",
        "Over 5 publications in prominent conferences and journals",
        "Part of the team that built the TouchCORE tool. My contribution was designing and building the model weaver in java",
        "Teaching assistant for several courses and subjects:",
        "Intro to java programming; Bash, C and python course; Relational databases; Model-Driven Software Development; Software Fault Tolerance"
      ]
    }
  ],
  "meta": {
    "theme": "autumn"
  }
}